{
  "backend/main.mo": "Main Motoko actor for the design studio backend, defining types for projects and user profiles, and exposing authenticated CRUD endpoints for user profiles and design projects with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (product selector, design canvas, color picker, toolbar, save design) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a quick reference for the purpose of each component, hook, and style file.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Product Design Studio' that mounts the React app at the #root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that composes the full design studio layout with a sidebar, design canvas, profile setup modal, theme provider, and toast notifications, wiring together all design state hooks.",
  "frontend/src/components/AppSidebar.tsx": "Dark sidebar component that stacks all tool panels (product selector, toolbar, color picker, element properties, save button, project list, and login) with user profile display for authenticated users.",
  "frontend/src/components/ColorPicker.tsx": "Reusable color picker component with a native color input, hex value display, and a grid of preset color swatches with active highlight styling.",
  "frontend/src/components/DesignCanvas.tsx": "Interactive canvas component that renders design elements (text, shapes) on a product background, supporting drag-to-move, corner-handle resizing, selection, and tool-mode-based click actions.",
  "frontend/src/components/DesignToolbar.tsx": "Sidebar toolbar component providing Select, Add Text, and Add Shape tool buttons, a shape-type sub-picker (rectangle/circle/triangle), and a delete button for the selected element.",
  "frontend/src/components/ElementProperties.tsx": "Properties panel that lets users edit the selected design element's text content, font size, color, width, and height via inputs and a slider.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that triggers Internet Identity login or logout, showing a loading spinner during the login flow and clearing the React Query cache on logout.",
  "frontend/src/components/ProductSelector.tsx": "Grid selector component for choosing a product type (t-shirt, shirt, mug, jug), displaying product images with active-state highlighting and tooltips.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown to new users prompting them to enter their name, which is then saved via the saveCallerUserProfile mutation to personalize the experience.",
  "frontend/src/components/ProjectList.tsx": "Displays the authenticated user's saved projects in a scrollable list with load and delete actions, mapping backend project data to frontend DesignElement and ProductType types.",
  "frontend/src/components/SaveDesignButton.tsx": "A React component that renders a 'Save Design' button which opens a dialog for naming and persisting the current design state to the backend via the `useSaveProject` mutation.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useDesignState.ts": "A custom hook that manages the full local design editor state (elements, tool mode, product type, colors, project metadata) and exposes CRUD operations for design elements.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations: fetching/saving user profiles, and fetching/saving/deleting projects via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports DM Sans and DM Serif Display fonts, configures Tailwind CSS, and defines an artisan-themed OKLCH color palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/types/design.ts": "TypeScript type definitions for the design editor, including product types, design element shapes, tool modes, and the overall `DesignState` interface, plus label and image asset maps.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom fonts (DM Sans/DM Serif Display), an oklch-based design token color palette including an artisan 'craft' palette, custom shadows, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing a custom merchandise design app (DesignCraft Studio) with its existing features, required image assets, architectural notes, and versioning metadata."
}